exports.seed = async function (knex) {
  await knex.raw("ALTER SEQUENCE specializations_id_seq RESTART WITH 1");
  await knex("specializations").del();

  const specializationsData = [
    {
      name: "Developers",
      description:
        "Категорія, що включає в себе фахівців, які займаються програмною розробкою. До цієї групи можуть входити фронтенд та бекенд розробники, а також фулстек розробники, які працюють з усіма аспектами розробки.",
      parent_id: null,
    },
    {
      name: "Testers",
      description:
        "Група, яка включає в себе фахівців у сфері тестування програмного забезпечення. Сюди входять автоматизовані тестувальники, мануальні тестувальники та інші спеціалізовані ролі, спрямовані на забезпечення якості продукту.",
      parent_id: null,
    },
    {
      name: "Project Managers",
      description:
        "Категорія, що включає спеціалістів у сфері управління проектами. Проектні менеджери відповідають за планування, керування та виконання проектів, спілкування з командою та клієнтами.",
      parent_id: null,
    },
    {
      name: "Designers",
      description:
        "Група, яка включає в себе фахівців у сфері дизайну. Сюди входять графічні дизайнери, веб-дизайнери, UX/UI дизайнери та інші, які займаються створенням естетично приємних та функціональних інтерфейсів.",
      parent_id: null,
    },
    {
      name: "Game Developers",
      description:
        "Група фахівців, які спеціалізуються на розробці відеоігор. Вони можуть включати програмістів, гейм-дизайнерів, графічних дизайнерів та інших спеціалізованих професій.",
      parent_id: 1,
    },
    {
      name: "Web Developers",
      description:
        "Веб-розробник – це фахівець, який створює і підтримує веб-сайти та веб-додатки.",
      parent_id: 1,
    },
    {
      name: "Mobile Developers",
      description:
        "Мобільний розробник – це фахівець, який створює додатки для мобільних пристроїв, таких як смартфони та планшети.",
      parent_id: 1,
    },
    {
      name: "Automated Tester",
      description:
        "Спеціаліст, який використовує інструменти та скрипти для автоматизації процесу тестування, зокрема автоматизоване тестування інтерфейсів, функціональності та продуктивності.",
      parent_id: 2,
    },
    {
      name: "Manual Tester",
      description:
        "Спеціаліст, який виконує ручне тестування, перевіряючи різні аспекти програмного забезпечення, такі як функціональність, сумісність та інші.",
      parent_id: 2,
    },
    {
      name: "IT Project Manager",
      description:
        "Фахівець, що керує проектами в галузі інформаційних технологій.",
      parent_id: 3,
    },
    {
      name: "Scrum Master",
      description:
        "Спеціаліст, що використовує методологію Scrum для керування проектами.",
      parent_id: 3,
    },
    {
      name: "Program Manager",
      description:
        "Фахівець, що керує групою проектів або програмою для досягнення стратегічних цілей.",
      parent_id: 3,
    },
    {
      name: "Graphic Designer",
      description:
        "Спеціаліст, який створює графічний контент, такий як логотипи, ілюстрації, та інші елементи для використання в інформаційних продуктах.",
      parent_id: 4,
    },
    {
      name: "Web Designer",
      description:
        "Спеціаліст, який створює дизайн веб-сайтів та веб-додатків, включаючи розміщення елементів, колірну палітру та взаємодію.",
      parent_id: 4,
    },
    {
      name: "Mobile Designer",
      description:
        "Спеціаліст, який спеціалізується на створенні дизайну для мобільних додатків, враховуючи особливості роботи на різних пристроях та екранах.",
      parent_id: 4,
    },
    {
      name: "Game Programmer",
      description:
        "Розробка програмного коду гри, включаючи логіку геймплею, взаємодію об'єктів та реалізацію графіки.",
      parent_id: 5,
    },
    {
      name: "Game Engineer",
      description:
        "Розробка інноваційних технологій та систем для вдосконалення ігрового процесу.",
      parent_id: 5,
    },
    {
      name: "Physics Game Developer",
      description:
        "Використання фізичних розрахунків для створення реалістичної поведінки об'єктів у грі.",
      parent_id: 5,
    },
    {
      name: "Frontend Developers",
      description:
        "Спеціалізовані фахівці, які створюють користувацький інтерфейс веб-додатків. Вони використовують HTML, CSS та JavaScript для покращення взаємодії користувача з веб-сайтами.",
      parent_id: 6,
    },
    {
      name: "Backend Developers",
      description:
        "Фахівці, які відповідають за розробку серверної частини веб-додатків. Вони працюють з базами даних, серверними мовами програмування та інфраструктурою для забезпечення функціональності додатка.",
      parent_id: 6,
    },
    {
      name: "Mobile Frontend",
      description:
        "Мобільний фронтенд відповідає за те, як виглядає і взаємодіє з користувачем мобільний додаток.",
      parent_id: 7,
    },
    {
      name: "React front-end developer",
      description:
        "Розробник, який спеціалізується на використанні бібліотеки React для створення користувацьких інтерфейсів. Використовує компонентний підхід та взаємодіє з RESTful API або GraphQL.",
      parent_id: 19,
    },
    {
      name: "Angular front-end developer",
      description:
        "Спеціаліст, який володіє фреймворком Angular і використовує його для створення динамічних веб-додатків. Розуміє концепції модулів, компонентів, сервісів та обробників подій.",
      parent_id: 19,
    },
    {
      name: "Vue.js developer",
      description:
        "Фахівець, який працює з Vue.js - легким та прогресивним фреймворком для створення інтерфейсів. Розробник із розумінням реактивного програмування та використання компонентного підходу.",
      parent_id: 19,
    },
    {
      name: "Node.js developer",
      description:
        "Розробник, який використовує Node.js для створення ефективних та масштабованих серверних додатків. Відомий високою продуктивністю та здатністю обробки багатьох одночасних запитів.",
      parent_id: 20,
    },
    {
      name: "PHP developer",
      description:
        "Розробник, який використовує PHP для розробки серверної частини веб-додатків. PHP є однією з найпоширеніших мов для створення динамічних веб-сайтів і взаємодії з базами даних. Часто використовується у комбінації з фреймворками, такими як Laravel чи Symfony.",
      parent_id: 20,
    },
    {
      name: "Ruby developer",
      description:
        "Спеціаліст, який використовує Ruby для створення гнучких та елегантних серверних додатків. Часто використовується у комбінації з фреймворком Ruby on Rails для прискорення розробки веб-додатків.",
      parent_id: 20,
    },
  ];

  for (const specialization of specializationsData) {
    await knex("specializations").insert(specialization);
  }
};
